// pages/about/about.js
Component({
  /**
   * 页面的初始数据
   */
  data: {
    diarydetail: [
      {
        date: "2021.03.21",
        text: "1.修复了一些已知bug\n2.优化了志愿报名体验\n3.优化了个人页面布局和志愿历史UI\n4.增加了反馈的审核和回复功能\n（小程序更好看（yong)了）",
        title: "V3.1.0"
      },
      {
        date: "2020.09.15",
        text:
          "1.再次升级UI并统一页面设计风格\n2.加入了新的页面加载动画\n3.志愿报名及管理功能进一步升级和简化\n4.组件化页面，降低代码耦合度\n（小程序真正进入可迭代状态）",
        title: "V3.0.0",
      },
      {
        date: "2020.05.17",
        text:
          "1.全面升级小程序UI和动画\n2.上线志愿招募功能\n3.完善个人信息的收集，简化报名流程\n4.管理员端上线志愿信息编辑，表单编辑，志愿发布，导出时长表功能\n（可以通过小程序报名啦！）",
        title: "V2.2.0",
      },
      {
        date: "2019.12.03",
        text:
          "1.增加志愿积分，志愿地图功能\n2.增加志愿招募预告功能\n3.优化个人页面UI\n4.整合管理员入口，增加管理员端发布预告、审核反馈、操作积分、处理缺勤功能\n（小程序上线啦！）",
        title: "V1.1.1",
      },
      {
        date: "2019.08.31",
        text:
          "实现了信息录入、推送展示、志愿历史和基础的反馈功能\n（小程序出生啦！）",
        title: "V1.0.0",
      },
    ],
  },
});
